rainer20512/stm32-fw/common/src/dev/xspi_dev.c
/*
 ******************************************************************************
 * @file    xspi_dev.c
 * @author  Rainer
 * @brief   QUADSPI or OCTOSPI hardware wrapped into HW_Device
 *
 *****************************************************************************/

/** @addtogroup QUADSPI
  * @{
   
*/
#include "config/config.h"

#include "hardware.h"

#if USE_QSPI > 0 || USE_OSPI > 0

#include "config/devices_config.h"

#if USE_OSPI > 0
    #include "config/ospi_config.h"
#else
    #include "config/qspi_config.h"
#endif

#include "error.h"
#include "task/minitask.h"
#include "system/profiling.h"
#include "system/hw_util.h"
#include "system/dma_handler.h" /**** 004 ****/
#include "system/clockconfig.h"
#include "system/pll.h"
#include "dev/hw_device.h"
#include "dev/devices.h"

#include "log.h"

#include "dev/xspi/flash_interface.h"
#include "dev/xspi/xspi_lowlevel.h"
#include "dev/xspi/xspi_helper.h"

extern  NOR_FlashT flash_interface;

#if DEBUG_MODE > 0
    char* XSpecific_GetChipTypeText(uint8_t *idbuf, char *retbuf, const uint32_t bufsize);
    void  XSpecific_DumpStatusInternal(XSpiHandleT *myHandle);
#endif



#if USE_OSPI > 0
    /* Currently the driver cannot handle both OCTOSPI devices in parallel */
    #if USE_OSPI1 > 0 && USE_OSPI2 > 0
        #error "Cannot handle OCTOSPI1 and OCTOSPI2 both active"
    #endif
    #if USE_OSPI1 > 0
        #define     XSpiStr                         "OSPI1"
        #define     XSPI_USE_IRQ                    OSPI1_USE_IRQ
        #define     XSPI_USE_DMA                    OSPI1_USE_DMA
    #else
        #define     XSpiStr                         "OSPI2"
        #define     XSPI_USE_IRQ                    OSPI2_USE_IRQ
        #define     XSPI_USE_DMA                    OSPI2_USE_DMA
    #endif
#else
        #define     XSpiStr                         "QSPI"
        #define     XSPI_USE_IRQ                    QSPI1_USE_IRQ
        #define     XSPI_USE_DMA                    QSPI1_USE_DMA
#endif


/* My macros --------------------------------------------------------------------*/

#define DEBUG_XSPI                  2

/* Private typedef --------------------------------------------------------------*/
typedef enum XSpiDmaDirectionEnum {
  XSPI_DMA_RD=0,                      // Read DMA
  XSPI_DMA_WR,                        // Write DMA
} XSpiDmaDirectionEnumType;

#if USE_OSPI > 0
    typedef enum OSpiSizeEnum {
        OSPI_QUAD=4,                     /* OCTOSPI used in QuadSpi-Mode */   
        OSPI_OCTO=8,                     /* OCTOSPI used in OctoSpi-Mode */   
    } OSpiSizeEnumType;
#endif

typedef struct {
    XSpiHandleT         *myXSpiHandle;   /* my associated handle */
    uint32_t            defaultSpeed;    /* default speed in MHz */
#if defined(STM32H7_FAMILY) || defined(STM32L4PLUS_FAMILY)           
    uint32_t            clkSource;       /* clock source as defined in stm32h7xx_hal_rcc.h */
#endif
    NOR_FlashT          *interface;      /* my flash chip interface */
#if USE_OSPI > 0 
    OSpiSizeEnumType    ospiMode;        /* currently QUADSPI and OCTOSPI mode are impelemted */
    uint8_t             bUseDQS;         /* true, iff DQS signal is active/used  */       
#endif
} XSpi_AdditionalDataType;



/* Forward declarations -------------------------------------------------------------*/


/* Private or driver functions ------------------------------------------------------*/
static XSpi_AdditionalDataType * XSpi_GetAdditionalData(const HW_DeviceType *self)
{
    return (XSpi_AdditionalDataType *)(self->devData);
}

#if 0 /* currently not used */
/*************************************************************************************
 * Initialize the dma channel. This has to be done before every read or write, because
 * QUADSPI only has one dma channel
 ************************************************************************************/
static void XSpiDmaChannelInit(const HW_DeviceType *self, XSpiDmaDirectionEnumType dmadir )
{
    const HW_DmaType *dma           = self->devDmaRx;
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
    XSpiHandleT *myHandle           = adt->myXSpiHandle;
    XXSPI_HandleTypeDef *hxspi       = &myHandle->hxspi;
    DMA_HandleTypeDef *hdma         = dma->dmaHandle;

    hdma->Instance                 = dma->dmaChannel;
    hdma->Parent                   = myHandle;
    hdma->Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma->Init.MemInc              = DMA_MINC_ENABLE;
    hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    hdma->Init.Mode                = DMA_NORMAL;
    hdma->Init.Priority            = DMA_PRIORITY_HIGH;
    hdma->Init.Request             = dma->dmaRequest;

    switch ( dmadir ) 
    {
    case XSPI_DMA_RD:
      hdma->Init.Direction = DMA_PERIPH_TO_MEMORY;
      hxspi->hdma = dma->dmaHandle;
      break;
    case XSPI_DMA_WR:
      hdma->Init.Direction = DMA_MEMORY_TO_PERIPH;
      hxspi->hdma = dma->dmaHandle;
      break;
    default:
        Error_Handler(__FILE__, __LINE__);
        return;
    }

    HAL_DMA_Init(hdma);

    return;
}
#endif

static void XSpiGpioInitAF(uint32_t devIdx, const HW_GpioList_AF *gpioaf)
{
    GPIO_InitTypeDef Init;

    Init.Mode = GPIO_MODE_AF_PP;
    Init.Speed = GPIO_SPEED_FREQ_HIGH;

    GpioAFInitAll(devIdx, gpioaf, &Init );
}

/**************************************************************************************
 * Some Devices support different clock sources for QSPI. Make sure, that             *   
  * XSpiSetClockSource and XGetClockSpeed() will match                                *
 *************************************************************************************/
#if defined(STM32L476xx) || defined(STM32L496xx)
    /* STM32L4xx has no clock mux for QUADSPI device */
    #define XSpiSetClockSource(a)           (true)
    #define XSpiGetClockSpeed(a)             HAL_RCC_GetHCLKFreq()


#elif defined(STM32H7_FAMILY)
    static bool XSpiSetClockSource(const HW_DeviceType *self)
    {
      RCC_PeriphCLKInitTypeDef PeriphClkInit;

