rainer20512/stm32-fw/common/src/dev/xspi_dev.c
      /* QSPI/OSPI has to be operaterd with HCLK. Routines, which will set */
      /* qspi/ospi speed, rely on HCLK as Clock source                     */
      #if defined(STM32L4PLUS_FAMILY)
          /* STM32L4S devices */
          PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_OSPI; 
          PeriphClkInit.OspiClockSelection   = RCC_OSPICLKSOURCE_SYSCLK;
      #else
          /* STM32H7 devices */
          PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_QSPI; 
          PeriphClkInit.QspiClockSelection   = XSpi_GetAdditionalData(self)->clkSource;
      #endif
      if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
        LOG_FATAL("failed to set CLK source for %s", XSpiStr);
        return false;
      }

      return true;
    }
    static uint32_t XSpiGetClockSpeed(const HW_DeviceType *self)
    {
        switch (XSpi_GetAdditionalData(self)->clkSource) 
        {
            case RCC_QSPICLKSOURCE_D1HCLK:
                return HAL_RCC_GetHCLKFreq();
            case RCC_QSPICLKSOURCE_PLL:
                /* PLL1Q */
                return PLL_GetOutFrq(SYS_PLL1, PLL_LINE_Q)*1000;
#if defined(RCC_QSPICLKSOURCE_PLL2)
            case RCC_QSPICLKSOURCE_PLL2:
                /* PLL2R H7-devices*/
                return PLL_GetOutFrq(SYS_PLL2, PLL_LINE_R)*1000;
#endif
#if defined(RCC_QSPICLKSOURCE_CLKP)
            case RCC_QSPICLKSOURCE_CLKP:
                /* peripheral Clock, H7 devices */
                return GetPerClkFrequency();
#endif
#if defined(RCC_QSPICLKSOURCE_MSI)
            case RCC_QSPICLKSOURCE_MSI:
                /* MSI , L4+ devices */
                return HAL_RCC_MSI_Freq();
#endif
            default:
                LOG_FATAL("failed to retrieve CLK source for %s", XSpiStr);
                return 0;
       }
    }
#elif defined(STM32L4PLUS_FAMILY)
    static bool XSpiSetClockSource(const HW_DeviceType *self)
    {
      RCC_PeriphCLKInitTypeDef PeriphClkInit;

      /* QSPI/OSPI has to be operaterd with HCLK. Routines, which will set */
      /* qspi/ospi speed, rely on HCLK as Clock source                     */
      #if defined(STM32L4PLUS_FAMILY)
          /* STM32L4S devices */
          PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_OSPI; 
          PeriphClkInit.OspiClockSelection   = RCC_OSPICLKSOURCE_SYSCLK;
      #else
          /* STM32H7 devices */
          PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_QSPI; 
          PeriphClkInit.QspiClockSelection   = XSpi_GetAdditionalData(self)->clkSource;
      #endif
      if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
        LOG_FATAL("failed to set CLK source for %s", XSpiStr);
        return false;
      }

      return true;
    }

    static uint32_t XSpiGetClockSpeed(const HW_DeviceType *self)
    {
        switch (XSpi_GetAdditionalData(self)->clkSource) 
        {
            case RCC_OSPICLKSOURCE_SYSCLK:
                return HAL_RCC_GetHCLKFreq();
            case RCC_OSPICLKSOURCE_PLL:
                /* PLL1Q */
                return PLL_GetOutFrq(SYS_PLL1, PLL_LINE_Q)*1000;
            case RCC_OSPICLKSOURCE_MSI:
                /* MSI , L4+ devices */
                return MSI_VALUE;
            default:
                LOG_FATAL("failed to retrieve CLK source for %s", XSpiStr);
                return 0;
       }
    }
#else 
    #error "No xspi clock assignment defined"
#endif

/*
 * Init or DeInit Clock / clocksource 
 */
static bool XSpiClockInit(const HW_DeviceType *self, bool bDoInit)
{
    /* Select clock source on init*/
    if ( bDoInit ) {
        if ( !XSpiSetClockSource(self) ) return false;
    }

    /* Enable/Disable clock */
    HW_SetHWClock(( void *)self->devBase, bDoInit);
    return true;
}


/**************************************************************************************
 * Return the flash memories specific geometry data                               *
 *************************************************************************************/
void XSpi_GetGeometry(XSpiHandleT *myHandle, XSpiGeometryT *pInfo)
{
    memcpy(pInfo, &myHandle->geometry, sizeof(XSpiGeometryT) );
}


/**************************************************************************************
 * Change the Qspi clock speed on the fly                                             *
 *************************************************************************************/
bool XSpi_SetSpeed (const HW_DeviceType *self, uint32_t new_clkspeed)
{
    XSpiHandleT *myHandle = XSpi_GetAdditionalData(self)->myXSpiHandle;  
    return XSpiLL_ClockInit(myHandle, XSpiGetClockSpeed(self), new_clkspeed, myHandle->geometry.FlashSize);
}

/**************************************************************************************
 * returns value != 0, iff successfully initialized                                   *
 *************************************************************************************/
bool XSpi_IsInitialized(XSpiHandleT *myHandle)
{
    return myHandle->bIsInitialized;
}


/**************************************************************************************
 * Dump Status and restore DeepSleep-Status afterwards                                *
 *************************************************************************************/
void XSpi_DumpStatus(XSpiHandleT *myHandle)
{
    bool sleep = myHandle->bInDeepPwrDown;
    /* Wake up device, if in deep sleep */
    if ( sleep && XSpi_LeaveDeepPowerDown(myHandle)==0 ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOG_ERROR("XSpi_DumpStatus - Error: Cannot wake up flash device");
        #endif
        return;
    }

    XSpecific_DumpStatusInternal(myHandle);
    
    if ( sleep ) XSpi_EnterDeepPowerDown(myHandle);
}

/**************************************************************************************
 * Set XSpi read, write/erase and error callbacks                                     *
 * After successful initialization, the device is deactivated to reduce power         *
 * consumption. So, to use the device, it has to be activated first                   *
 *************************************************************************************/
void XSpi_SetAsyncCallbacks(XSpiHandleT *myHandle, XSpiCallbackT rdDoneCB, XSpiCallbackT wrDoneCB, XSpiCallbackT errorCB)
{
    myHandle->XSpi_RdDoneCB  = rdDoneCB;
    myHandle->XSpi_WrDoneCB  = wrDoneCB;
    myHandle->XSpi_ErrorCB   = errorCB; 
}

