rainer20512/stm32-fw/common/src/dev/xspi_dev.c
    #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
        LOGU_VERBOSE("Write Init, area: 0x%08x ... 0x%08x, written in %d steps", WriteAddr,smData.WriteEndAddr-1, Size/myHandle->geometry.ProgPageSize);
    #endif

    /* Wake up device, if it has deep sleep capability and is in deep sleep */
    if ( myHandle->bInDeepPwrDown && XSpi_LeaveDeepPowerDown(myHandle)==0 ) return false;

    return true;
}

static void WriteEraseTerminate(bool finalState, uint32_t opmode, XSpiHandleT *myHandle)
{
    if ( opmode != XSPI_MODE_POLL ) {
        if ( !myHandle->bAsyncBusy ) {
            #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                LOGU_ERROR("WriteEraseTerminate - Error: Async Op not active");
            #endif
        }
        myHandle->bAsyncBusy = false;
    }
    LOGU_VERBOSE("Write/Erase terminated %s",finalState ? "ok" : "with error");

    /* Activate Callback, if specified */
    if (myHandle->XSpi_WrDoneCB) myHandle->XSpi_WrDoneCB(myHandle);
}


static bool WriteBlock (void )
{
    bool ret;

    LOGU_VERBOSE("Write @0x%08x, Len=%d", smData.currWriteAddr, smData.currWriteSize);
    LOGU_VERBOSE("First Bytes (hex)= %02x, %02x, %02x, %02x, ...", 
                  smData.WriteSource[0], smData.WriteSource[1], smData.WriteSource[2], smData.WriteSource[3]);
    /* Enable write and send write command */
    // if ( !XSpecific_SetupWrite(GETWRHANDLE(), smData.currWriteAddr, smData.currWriteSize) ) return false;

    switch ( smData.wrOpmode ) {
        case XSPI_MODE_POLL:
            /* Transmission of the data in polling mode*/
            #if USE_OSPI > 0
                ret = HAL_OSPI_Transmit(GETWRHANDLE(), smData.WriteSource, XSPI_TIMEOUT_DEFAULT_VALUE) == HAL_OK;
            #else
                ret = HAL_QSPI_Transmit(GETWRHALHANDLE(), smData.WriteSource, XSPI_TIMEOUT_DEFAULT_VALUE) == HAL_OK;
            #endif
            break;
        case XSPI_MODE_IRQ:
            /* Transmission of the data in irq mode*/
            #if USE_OSPI > 0
                ret = HAL_OSPI_Transmit_IT(GETWRHALHANDLE(), smData.WriteSource) == HAL_OK;
            #else
                ret = HAL_QSPI_Transmit_IT(GETWRHALHANDLE(), smData.WriteSource) == HAL_OK;
            #endif
            break;
        case XSPI_MODE_DMA:
            /* Transmission of the data in irq mode*/
            #if USE_OSPI > 0
                ret = HAL_OSPI_Transmit_DMA(GETWRHALHANDLE(), smData.WriteSource) == HAL_OK;
            #else
                ret = HAL_QSPI_Transmit_DMA(GETWRHALHANDLE(), smData.WriteSource) == HAL_OK;
            #endif
            break;
        default:
            #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                LOGU_ERROR("WriteLoop - Error: Mode %d not implemented", smData.wrOpmode);
            #endif
            return false;
    } // switch

    /* report errors, if configured */
    if ( !ret ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_ERROR("WriteLoop - Error: Transmit error in mode %d", smData.wrOpmode);
        #endif
    }

    return true;
}

static bool WaitForWriteDone(void)
{
    bool ret;

    /* Configure automatic polling mode to wait for reset of WIP bit */  
    if ( smData.wrOpmode == XSPI_MODE_POLL ) 
        ret = XSpiLL_WaitForWriteDone(GETWRDEVHANDLE(), XSPI_TIMEOUT_DEFAULT_VALUE);
    else 
        ret = XSpiLL_WaitForWriteDone_IT(GETWRDEVHANDLE());
 
    if ( !ret ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_ERROR("QSpi_SpecificWriteWait - Error: Timeout while autopll");
        #endif
        return false;
    }
    
    return true;
}

static bool WriteIncement(XSpiHandleT *myHandle)
{
    /* Update the address and size variables for next page programming */
    smData.currWriteAddr += smData.currWriteSize;
    smData.WriteSource   += smData.currWriteSize;
    smData.currWriteSize = ((smData.currWriteAddr + myHandle->geometry.ProgPageSize) >smData.WriteEndAddr) ? (smData.WriteEndAddr - smData.currWriteAddr) : myHandle->geometry.ProgPageSize;
  
    return smData.currWriteAddr <smData.WriteEndAddr;
}
#define WRSTATE_START       0
#define WRSTATE_WRITEBLOCK  1
#define WRSTATE_WAITFORDONE 2
#define WRSTATE_INCREMENT   3
#define WRSTATE_TERMINATE   4
#define STATE_ERROR         99

#define WR_NEXTSTATE(a)     smData.wrState=a
#define WR_SM_PAUSE(a)      bSmPause=a
static bool WriteSM(void)
{
    bool bSmPause = false;

    while (!bSmPause ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_VERBOSE("WriteSM in state %d", smData.wrState);
        #endif
        switch ( smData.wrState ) {
            case WRSTATE_START: 
                /* Enable Write and Send Write Command - both in one step */
                if ( !XSpiLL_WriteCMD(GETWRDEVHANDLE(), smData.currWriteAddr, smData.currWriteSize) ) goto WriteSmTerminate;
                /* Continue with next state in any case*/
                WR_NEXTSTATE(WRSTATE_WRITEBLOCK);
                WR_SM_PAUSE(false);
                break;
            case WRSTATE_WRITEBLOCK:
                if (!WriteBlock() ) goto WriteSmTerminate;
                WR_NEXTSTATE(WRSTATE_WAITFORDONE);
                /* In Async mode the next state will be triggered by interrupt, proceed directly in polling mode */
                WR_SM_PAUSE( smData.wrOpmode != XSPI_MODE_POLL );
                break;
            case WRSTATE_WAITFORDONE:
                if ( !WaitForWriteDone() ) goto WriteSmTerminate;
                WR_NEXTSTATE(WRSTATE_INCREMENT);
                /* In Async mode the next state will be triggered by interrupt, proceed directly in polling mode */
                WR_SM_PAUSE( smData.wrOpmode != XSPI_MODE_POLL );
                break;
            case WRSTATE_INCREMENT:
                /* increment the loop counters and check for termination */
                if ( WriteIncement(smData.wrHandle) ) 
                    WR_NEXTSTATE(WRSTATE_WRITEBLOCK);
                else
                    WR_NEXTSTATE(WRSTATE_TERMINATE);
                /* Continue with next state right now*/
                WR_SM_PAUSE(false);
                break;
            case WRSTATE_TERMINATE:
                /* Final State reached without error */
                WriteEraseTerminate(true, smData.wrOpmode, smData.wrHandle);
                return true;
            case STATE_ERROR:
                /* Error state, reached only by error Interrupt; */
                goto WriteSmTerminate;    
            default:
                #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                    LOGU_ERROR("WriteSM - Error: illegal state %d", smData.wrState);
                #endif
                goto WriteSmTerminate;
        } // switch
    } // while
    return true;

