rainer20512/stm32-fw/common/src/dev/xspi_dev.c
WriteSmTerminate:
    // All erroneous exits are handeled here
    WriteEraseTerminate(false, smData.wrOpmode, smData.wrHandle);
    return false;
}

bool XSpi_WriteWait(XSpiHandleT *myHandle, uint8_t* pData, uint32_t WriteAddr, uint32_t Size) {
    if ( !WriteInit(myHandle, pData, WriteAddr, Size, XSPI_MODE_POLL, WriteSM) ) return false;
    return WriteSM();
}
bool XSpi_WriteIT  (XSpiHandleT *myHandle, uint8_t* pData, uint32_t WriteAddr, uint32_t Size) {
    if ( !WriteInit(myHandle, pData, WriteAddr, Size, XSPI_MODE_IRQ, WriteSM) ) return false;
    return WriteSM();
}
bool XSpi_WriteDMA  (XSpiHandleT *myHandle, uint8_t* pData, uint32_t WriteAddr, uint32_t Size) {
    if ( !WriteInit(myHandle, pData, WriteAddr, Size, XSPI_MODE_DMA, WriteSM) ) return false;
    return WriteSM();
}

/*-----------------------------------------------------------------------------
 * Erase - Erase - Erase - Erase - Erase - Erase - Erase - Erase - Erase - Eras
 *---------------------------------------------------------------------------*/


/******************************************************************************
 * Implement a classic loop with four components
 * - Initialisation
 * - Loop body
 * - Change loop variables and check for termination
 * - terminate
 * This is done, because the loop execution is triggered direcly ( in polling mode )
 * or by interrupts ( in IRQ or DMA mode )
 *****************************************************************************/
static bool EraseInit(XSpiHandleT *myHandle, uint32_t EraseAddr, uint32_t numItems, XSpi_EraseMode erasemode, uint32_t opmode, XSpi_SM_Fn stateMachine)
{
    if ( opmode != XSPI_MODE_POLL ) {
        if ( myHandle->bAsyncBusy ) {
            #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                LOGU_ERROR("EraseInit - Error: Another Async Op is active");
            #endif
            return false;
        }
        myHandle->bAsyncBusy = true;
    }

    /* check for positive size */
    if ( numItems == 0 ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_ERROR("EraseInit - Erasing 0 items not allowed");
        #endif
        return false;
    }

    const  NOR_EraseModeTypeT *e = erasemode != XSPI_ERASE_ALL ? myHandle->interface->erase.p_erase[erasemode] : myHandle->interface->erase.f_erase;
    if ( e == NULL ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_ERROR("EraseInit - Erase mode &d not defined");
        #endif
        return false;
    }

    /* Initialize the neccessary erase data */
    smData.currEraseAddr = EraseAddr;
    smData.EraseItemCnt  = ( erasemode == XSPI_ERASE_ALL ? 1 : numItems);
    smData.EraseMode     = erasemode;
    smData.erOpmode      = opmode;
    smData.EraseAddrInc  = e->block_size;
    smData.erState       = 0;
    smData.erHandle      = myHandle;
    smData.ecmd          = &e->cmd;
    erSM                 = stateMachine;
    wrSM                 = NULL;

    #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
        LOGU_VERBOSE("Erase Init, start: 0x%08x, itemsize=%d, items=%d, mode=%d", EraseAddr, smData.EraseAddrInc, smData.EraseItemCnt, erasemode);
    #endif

    /* Wake up device, if it has deep sleep capability and is in deep sleep */
    if ( myHandle->bInDeepPwrDown && XSpi_LeaveDeepPowerDown(myHandle)==0 ) return false;

    return true;
}

static bool WaitForEraseDone(uint32_t timeout_ms)
{
    bool ret;

    /* Configure automatic polling mode to wait for reset of WIP bit */  
    if ( smData.erOpmode == XSPI_MODE_POLL ) 
        ret = XSpiLL_WaitForWriteDone(GETERDEVHANDLE(), timeout_ms);
    else 
        ret = XSpiLL_WaitForWriteDone_IT(GETERDEVHANDLE());
 
    if ( !ret ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_ERROR("QSpi_SpecificWait - Error: Timeout while autopoll");
        #endif
        return false;
    }
    
    return true;
}

static bool EraseIncement(void)
{
    /* Update the address and decrement count */
    if ( --smData.EraseItemCnt == 0 ) return false;

    smData.currEraseAddr += smData.EraseAddrInc;
    return true;
}


#define ERSTATE_START       0
#define ERSTATE_WAITFORDONE 1
#define ERSTATE_INCREMENT   2
#define ERSTATE_TERMINATE   3
#define STATE_ERROR         99

#define ER_NEXTSTATE(a)     smData.erState=a
#define ER_SM_PAUSE(a)      bSmPause=a

static bool EraseSM(void)
{
    bool bSmPause = false;
    uint32_t tmo_ms;

    while (!bSmPause ) {
        #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
            LOGU_VERBOSE("EraseSM in state %d", smData.erState);
        #endif
        switch ( smData.erState ) {
            case ERSTATE_START: 
                /* Enable Write and Send Erase Command - both in one step */
                LOGU_VERBOSE("Erase @0x%08x, mode=%d", smData.currEraseAddr, smData.EraseMode);
                if ( !XSpiLL_Erase(GETERDEVHANDLE(), smData.currEraseAddr, smData.ecmd) ) goto EraseSmTerminate;
                /* Continue with next state in any case*/
                ER_NEXTSTATE(ERSTATE_WAITFORDONE);
                /* Continue with waiting for completion immediately */
                ER_SM_PAUSE( false );
                break;
            case ERSTATE_WAITFORDONE:
                tmo_ms = (smData.ecmd->exec_time+500) / 1000;
                if ( !WaitForEraseDone(tmo_ms) ) goto EraseSmTerminate;
                LOGU_VERBOSE("Erase done");
                ER_NEXTSTATE(ERSTATE_INCREMENT);
                /* In Async mode the next state will be triggered by interrupt, proceed directly in polling mode */
                ER_SM_PAUSE( smData.erOpmode != XSPI_MODE_POLL );
                break;
            case ERSTATE_INCREMENT:
                /* increment the loop counters and check for termination */
                if ( EraseIncement() ) 
                    ER_NEXTSTATE(ERSTATE_START);
                else
                    ER_NEXTSTATE(ERSTATE_TERMINATE);
                /* Continue with next state right now*/
                ER_SM_PAUSE(false);
                break;
            case ERSTATE_TERMINATE:
                /* Final State reached without error */
                WriteEraseTerminate(true, smData.erOpmode, smData.erHandle);
                return true;
            case STATE_ERROR:
                /* Error state, reached only by error Interrupt; */
                goto EraseSmTerminate;    
            default:
                #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                    LOGU_ERROR("EraseSM - Error: illegal state %d", smData.erState);
                #endif
                goto EraseSmTerminate;
        } // switch
    } // while
    return true;

EraseSmTerminate:
    // All erroneous exits are handeled here
    WriteEraseTerminate(false, smData.erOpmode, smData.erHandle);
    return false;
}
/******************************************************************************
 * @brief Get different erase sizes and optionally corresponding max erase times
 * @param  myHandle  - XSpi handle
 * @param  Sizes     - return array for different erase sizes, not NULL
 * @param  Max_Times - max erase times[us], may be NULL
 * @retval Number of defined erase elements 
 * @note   Does not include Full Chip erase
 * @note   a returned size of 0 means "not defined"
 * @note   Array "Sizes" and optionally "Max_Times" 
 *****************************************************************************/
uint32_t XSpi_GetEraseData      (XSpiHandleT *myHandle, uint32_t *Sizes, uint32_t *Max_Times)
{
    const  NOR_EraseModeTypeT * const *e = myHandle->interface->erase.p_erase;
    /* clear sizes array */
    memset(Sizes, 0, sizeof(uint32_t)*XSPI_MAX_ERASE_MODE);

    uint32_t i=0;
    while ( i < XSPI_MAX_ERASE_MODE && e[i] != NULL ) {
        Sizes[i] = e[i]->block_size;
        if (Max_Times) Max_Times[i] = e[i]->cmd.exec_time;
        i++;
    }
    
    return i;
}
        
/* Erase <numSect> consecutive block, first block specified by <EraseAddr> */
bool XSpi_EraseWait             (XSpiHandleT *myHandle, XSpi_EraseMode mode, uint32_t EraseAddr, uint32_t numElem)
{
    if (!EraseInit(myHandle, EraseAddr, numElem, mode, XSPI_MODE_POLL, EraseSM )) return false;
    return EraseSM();
}
bool XSpi_EraseIT               ( XSpiHandleT *myHandle, XSpi_EraseMode mode, uint32_t EraseAddr, uint32_t numElem)
{
    if (!EraseInit(myHandle, EraseAddr, numElem, mode, XSPI_MODE_IRQ, EraseSM )) return false;
    return EraseSM();
}

