rainer20512/stm32-fw/common/src/dev/xspi_dev.c
    HW_SetHWClock(hxspi->Instance, true);
    #if defined(OCTOSPIM)
        HW_SetHWClock(OCTOSPIM, true);
    #endif

    HW_Reset(hxspi->Instance);

    uint32_t devIdx = GetDevIdx(self);
    XSpiGpioInitAF(devIdx, self->devGpioAF);

    /* First disable QUADSPI/OCTOSPI hardware */
    #if USE_OSPI > 0
        HAL_OSPI_DeInit(hxspi);
    #else
        HAL_QSPI_DeInit(hxspi);
    #endif

    XHelper_SetGeometry(myHandle, &myHandle->geometry);
    XSpiLL_DumpGeometry(&myHandle->geometry);
 
    /* if we have a separate init speed, use this first, otherwise init to normal operating speed */
    bHasInitSpeed = myHandle->interface->global.flags & FCOMMON_HAS_INIT_SPEED;
    target_speed  = bHasInitSpeed ? myHandle->interface->global.init_frq : myHandle->interface->global.operating_frq;
    ret = XSpiLL_ClockInit(myHandle, XSpiGetClockSpeed(self), target_speed,myHandle->geometry.FlashSize );
    
    #if USE_OSPI > 0
        if (ret) ret = OSPI_Configure_OSPIM(self);
    #endif

    if ( ret ) {
        if ( self->devIrqList ) {
            /* Configure the NVIC, enable interrupts */
            HW_SetAllIRQs(self->devIrqList, true);
        }

        if ( !(ret=XSpiLL_GetID(myHandle)) ) {
            #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                if ( !ret ) LOGU_ERROR("Unable to read XSpi chip ID");
            #endif
            #if DEBUG_MODE > 0
                XSpiLL_DumpChipInfo(myHandle->id);
                if ( console_debuglevel > 0 )  XSpi_DumpStatus(myHandle);
            #endif
        }

        /* 
         * Initialize DMA channel, if configured to use DMA
         * only regard devDmaRx, ...Tx is never used, because there is only one DMA request type
         */
        #if 0  
        // RHB tbd
        if ( self->devDmaRx ) {
        /**** 004 ****/
        DMA_HandleTypeDef *hdma;
        hdma = HW_DMA_RegisterDMAChannel(self->devDmaRx);
        ret = hdma != NULL;
        /* dma channel initiialization has to be done before every rd or wr operation
           because there is only one dma channel                                      */
        if ( ret ) {
            xhandle->hRxDma = dma->dmaHandle;
        }
        #endif

        /*
         * if we have a lower init speed, then execute the chip specific part of initialization
         * and switch to normal operating speed
         */

        if ( bHasInitSpeed ) {
            if ( myHandle->interface->init ) {
                ret = myHandle->interface->init();
                #if DEBUG_MODE > 0 && DEBUG_XSPI > 0
                    if ( !ret ) LOGU_ERROR("driver specific init failed");
                #endif
            }
            /* now switch to normal operating speed */
            if ( ret ) {
                ret = XSpiLL_ClockInit(myHandle, XSpiGetClockSpeed(self), myHandle->interface->global.operating_frq, myHandle->geometry.FlashSize );        
            }
        }
        
    }
    if ( ret ) {
        /* If deep sleep is supported, put flash chip into deep sleep mode */
        if ( XHelper_HasDeepPowerDown(myHandle) ) XSpi_EnterDeepPowerDown(myHandle);
    } else {
        /* If Initialization was unsuccessful, deactivate all */
        XSpi_DeInit(self);
    }

    myHandle->bIsInitialized = ret;
    return ret;
}

/**********************************************************************************
 * Early Init of QSPI Device to enable R/W of config values
 *********************************************************************************/
void XSpi_EarlyInit(void)
{
    int32_t dev_idx;

    /* Init QSPI device */
    dev_idx = AddDevice(&XSPI_DEV, NULL ,NULL);
    DeviceInitByIdx(dev_idx, NULL);
}


/******************************************************************************
 * Check, whether the system may enter Stop 2 mode. 
 * This is the case, if neither transmit nor receive are active
 *****************************************************************************/
bool XSpi_AllowStop(const HW_DeviceType *self)
{
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
#if USE_OSPI > 0 
    return ! (adt->myXSpiHandle->hxspi.Instance->SR & OCTOSPI_SR_BUSY);
#else
    return ! (adt->myXSpiHandle->hxspi.Instance->SR & QUADSPI_SR_BUSY);
#endif
}


/******************************************************************************
 * Callback _before_ frequency changes: To be on the safe side, switch to
 * high performance mode
 *****************************************************************************/
void XSpi_BeforeFrqChange(const HW_DeviceType *self)
{
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
    XSpiHandleT *myHandle           = adt->myXSpiHandle;  

    if ( XHelper_HasHighPerformanceMode( myHandle) ) XSpiLL_EnterHPMode( myHandle);
}


/******************************************************************************
 * Callback _after_ frequency changes: Recalculate the QUADSPI hardware 
 * prescaler to a give an operating freqency at or below desired frequency
 *****************************************************************************/
bool XSpi_OnFrqChange(const HW_DeviceType *self)
{
    XSpi_AdditionalDataType *adt    = XSpi_GetAdditionalData(self);
    XSpiHandleT *myHandle           = adt->myXSpiHandle;  

    return XSpiLL_ClockInit(myHandle, XSpiGetClockSpeed(self), myHandle->clkspeed, myHandle->geometry.FlashSize );

}

///////////////////////////////////////////////////////////////////////////////
// Global Variables  /////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
#if defined(QUADSPI) && USE_QSPI > 0

    XSpiHandleT QSpi1Handle;

    #ifdef QSPI1_USE_DMA
      static DMA_HandleTypeDef hdma_qspi1;
      static const HW_DmaType dma_qspi1 = { &hdma_qspi1, QSPI1_DMA };
    #endif

    #if defined( QSPI1_USE_IRQ )
    const HW_IrqList irq_qspi1 = {
        .num = 1,
        .irq = {QSPI1_IRQ },
    };
    #endif

    /* QUADSPI: 6 AF-Pins, NCS, CLK, SIO0, ..., SIO3 */
    static const HW_GpioList_AF gpio_qspi1 = {
        .num  = 6,
        .gpio = { 
            QSPI1_NCS, QSPI1_CLK,
            QSPI1_SI_SIO0, QSPI1_SO_SIO1,
            QSPI1_SIO2, QSPI1_SIO3,
        }
    };

