rainer20512/stm32-fw/common/src/dev/xspi_dev.c
const HW_DeviceType HW_OSPI2 = {
    .devName        = XSpiStr,
    .devBase        = OCTOSPI2,
    .devGpioAF      = &gpio_ospi2,
    .devGpioIO      = NULL,
    .devGpioADC     = NULL,
    .devType        = HW_DEVICE_XSPI,
    .devData        = &additional_ospi2,
    .devIrqList     = 
        #if defined(OSPI2_USE_IRQ) 
            &irq_ospi2,
        #else
            NULL,
        #endif
    /* There is only one dma channel for quadspi, so we assign that  *
     * to .devDmaRx, even it's used for both directions              */
    #if defined(OSPI2_USE_DMA)
        .devDmaRx = &dma_ospi2,
    #else
        .devDmaRx   = NULL,
    #endif
    .devDmaTx       = NULL,         /* .devDmaTx  is never used */
    .Init           = XSpi_Init,
    .DeInit         = XSpi_DeInit,
    .BeforeFrqChange= XSpi_BeforeFrqChange,
    .OnFrqChange    = XSpi_OnFrqChange,
    .AllowStop      = XSpi_AllowStop,
    .OnSleep        = NULL,
    .OnWakeUp       = NULL,
};
#endif /* defined(OCTOSPI2) && defined(USE_OSPI2) */



///////////////////////////////////////////////////////////////////////////////
// Interrupt routines QUADSPI /////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
#if USE_QSPI > 0 && defined(QSPI1_USE_IRQ)
    /**
      * @brief  Command completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_CmdCpltCallback(QSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("CmdCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Rx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_RxCpltCallback(QSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("RxCplt Callback");
      QSpi1Handle.bAsyncBusy = false;  
      if ( QSpi1Handle.XSpi_RdDoneCB ) QSpi1Handle.XSpi_RdDoneCB(&QSpi1Handle);
    }

    /**
      * @brief  Tx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_TxCpltCallback(QSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("TxCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Status Match callbacks
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_QSPI_StatusMatchCallback(QSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("StatusMatch Callback");
        TaskNotify(TASK_XSPI);
    }

    void HAL_QSPI_ErrorCallback(QSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("ERROR CALLBACK");
      /* Set error state and trigger next call of SM */
      smData.wrState = STATE_ERROR;
      TaskNotify(TASK_XSPI);
    }
#endif /* USE_QSPI > 0 && defined(QSPI_USE_IRQ) */



#if USE_OSPI > 0 && ( defined(OSPI1_USE_IRQ) || defined(OSPI2_USE_IRQ) )
    /**
      * @brief  Command completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_CmdCpltCallback(OSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("CmdCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Rx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_RxCpltCallback(OSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("RxCplt Callback");
      #if USE_OSPI1 > 0
          OSpi1Handle.bAsyncBusy = false;  
          if ( OSpi1Handle.XSpi_RdDoneCB ) OSpi1Handle.XSpi_RdDoneCB(&OSpi1Handle);
      #else
          OSpi2Handle.bAsyncBusy = false;  
          if ( OSpi2Handle.XSpi_RdDoneCB ) OSpi2Handle.XSpi_RdDoneCB(&OSpi2Handle);
       #endif
    }

    /**
      * @brief  Tx Transfer completed callbacks.
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_TxCpltCallback(OSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("TxCplt Callback");
        TaskNotify(TASK_XSPI);
    }

    /**
      * @brief  Status Match callbacks
      * @param  hxspi: QSPI handle
      * @retval None
      */
    void HAL_OSPI_StatusMatchCallback(OSPI_HandleTypeDef *hxspi)
    {
        UNUSED(hxspi);
        LOGU_VERBOSE("StatusMatch Callback");
        TaskNotify(TASK_XSPI);
    }

    void HAL_OSPI_ErrorCallback(OSPI_HandleTypeDef *hxspi)
    {
      UNUSED(hxspi);
      LOGU_VERBOSE("ERROR CALLBACK");
      /* Set error state and trigger next call of SM */
      smData.wrState = STATE_ERROR;
      TaskNotify(TASK_XSPI);
    }
#endif /* USE_OSPI > 0 && ( defined(OSPI1_USE_IRQ) || defined(OSPI2_USE_IRQ) ) */


void task_handle_xspi(uint32_t arg)
{
    UNUSED(arg);
    /* Only one SM may be active at one time, check which */
    if      (wrSM) wrSM();
    else if (erSM) erSM(); 
}

#endif /* if USE_QSPI > 0 || USE_OSPI > 0 */


/**
  * @}
  */


